# Data Cleaning and Transformation

In this section I will explain the process of cleaning and transforming your data.  These are necessary (and evil) steps before you are able to implement a machine learning model to your data.  Many data scientists will tell you that a majority of their time is spent cleaning and preparing the data and not fitting actual models.

$\it{Data Cleaning:}$ refers to the process of removing unwanted, irrelevant, or corrupted data from your dataset.

$\it{Data Transformation:}$ refers to the process of converting or transforming data into a format that makes it easier to process for a machine learning model

## Five characteristics of quality data:


#### Validity:

Data Validity is ensuring there is consistency within a dataset's features.  This can mean ensuring there are no incorrect class types or out of range numerical values that would throw an error if fed into a ML model. 


#### Accuracy:

Accuracy refers to making sure that the data you are using is feasible and meaningful.  A ML model trained on inaccurate data will follow the programming logic of "garbage in - garbage out" in terms of performance.

#### Completeness:

Completeness refers to ensuring that observations are not missing values.  If there are features that are missing values you must either drop that observation or impute the missing value based on some other logic.

#### Consistency:

Data consistency is making sure that the data you are feeding to your ML model matches the same information that is stored in what ever data warehousing program you are using.

#### Uniformity:

Data uniformity is making sure that aren't multiple data formats within a feature.  Think of a column that has temperatures in both fehrenheit and celsius.

<br>
<br>

## Data Cleaning/Transformation Practice with Python

Below is a premade dataset of data scientist salaries that we will manipulate with various data cleaning methods.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

data = {'Name' : ['Steve','Dave','Susan','Mike','Alice','Bob','Sarah','Nicole','Heather','Dave','Alice','Alex'],
        'Age' : ['49', '30', '44', '26', '32', '42', '45', '53', '44', '30', '32', '41'],
        'State' : ['New York', 'Massachusetts', 'Texas', 'New York', 'Pennsylvania', 'Idaho', 'New York', 'Arizona', 'Texas', 'Massachusetts', 'Pennsylvania', 'New York'],
        'City' : ['New York', 'Boston', 'Houston', 'new york', 'Philadelphia', np.nan, 'New York', 'Phoenix', 'Dallas', 'Boston', 'Philadelphia', 'New York'],
        'Salary' : [85000, 105000, 88000, 90000, 56000, 58000, np.nan , 55000, 1000000, 105000, 56000, 110000],
        'Fav.Color' : ['Blue', 'Red', 'Blue', 'Purple', 'Yellow', 'Green', 'Blue', 'Purple', 'Red', 'Purple', 'Green', 'Red']
                  }

df = pd.DataFrame(data)

display(df)

/lib/python3.9/site-packages/pandas/compat/__init__.py:124: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

       Name Age          State          City     Salary Fav.Color
0     Steve  49       New York      New York    85000.0      Blue
1      Dave  30  Massachusetts        Boston   105000.0       Red
2     Susan  44          Texas       Houston    88000.0      Blue
3      Mike  26       New York      new york    90000.0    Purple
4     Alice  32   Pennsylvania  Philadelphia    56000.0    Yellow
5       Bob  42          Idaho           NaN    58000.0     Green
6     Sarah  45       New York      New York        NaN      Blue
7    Nicole  53        Arizona       Phoenix    55000.0    Purple
8   Heather  44          Texas        Dallas  1000000.0       Red
9      Dave  30  Massachusetts        Boston   105000.0    Purple
10    Alice  32   Pennsylvania  Philadelphia    56000.0     Green
11     Alex  41       New York      New York   110000.0       Red

## Converting Data Types

Sometimes our dataframe can have features that take on a data type that might not be what we need it to be. For this reason it's good practice to double check the datatypes of features within your dataset.  In our example above, the feature Age appears to be numeric at first glance, but running df.dtype shows us that its actually stored as an object and not an int.  We will need to change this features datatype in order to use it properly for our modeling

In [2]:


print('===============================================================')
display(df)
print('===============================================================')


print('Data Types before conversion')
print(df.dtypes)

df['Age'] = df['Age'].astype(int)

print('')
print('Data Types after conversion')
print(df.dtypes)

===============================================================

       Name Age          State          City     Salary Fav.Color
0     Steve  49       New York      New York    85000.0      Blue
1      Dave  30  Massachusetts        Boston   105000.0       Red
2     Susan  44          Texas       Houston    88000.0      Blue
3      Mike  26       New York      new york    90000.0    Purple
4     Alice  32   Pennsylvania  Philadelphia    56000.0    Yellow
5       Bob  42          Idaho           NaN    58000.0     Green
6     Sarah  45       New York      New York        NaN      Blue
7    Nicole  53        Arizona       Phoenix    55000.0    Purple
8   Heather  44          Texas        Dallas  1000000.0       Red
9      Dave  30  Massachusetts        Boston   105000.0    Purple
10    Alice  32   Pennsylvania  Philadelphia    56000.0     Green
11     Alex  41       New York      New York   110000.0       Red

===============================================================
Data Types before conversion
Name          object
Age           object
State         object
City          object
Salary       float64
Fav.Color     object
dtype: object

Data Types after conversion
Name          object
Age            int32
State         object
City          object
Salary       float64
Fav.Color     object
dtype: object

## String Manipulation

An important step in cleaning your data is checking for uniformity in your values.  As we explore the unique values in each column of our dataframe we can see that Mike's city entry isn't capitalized.  Unforunately, pandas isn't smart enough to recognize that Mike's city is the same as Sarah's, which means were going to have to alter his city entry.

In [3]:
df1 = df.copy()

# The code below prints out all the unique values for each column which allows you to check for uniformity.
print('Unique Values for each column:')
print('===============================================================')

for col in df1:
    print(df[col].unique())
    
print('===============================================================')
print('')

df1['City'] = df1['City'].str.title()

print("We can see that Mike's City entry is now capatilized.")
print('===============================================================')
display(df1)

Unique Values for each column:
===============================================================
['Steve' 'Dave' 'Susan' 'Mike' 'Alice' 'Bob' 'Sarah' 'Nicole' 'Heather'
 'Alex']
[49 30 44 26 32 42 45 53 41]
['New York' 'Massachusetts' 'Texas' 'Pennsylvania' 'Idaho' 'Arizona']
['New York' 'Boston' 'Houston' 'new york' 'Philadelphia' nan 'Phoenix'
 'Dallas']
[  85000.  105000.   88000.   90000.   56000.   58000.      nan   55000.
 1000000.  110000.]
['Blue' 'Red' 'Purple' 'Yellow' 'Green']
===============================================================

We can see that Mike's City entry is now capatilized.
===============================================================

       Name  Age          State          City     Salary Fav.Color
0     Steve   49       New York      New York    85000.0      Blue
1      Dave   30  Massachusetts        Boston   105000.0       Red
2     Susan   44          Texas       Houston    88000.0      Blue
3      Mike   26       New York      New York    90000.0    Purple
4     Alice   32   Pennsylvania  Philadelphia    56000.0    Yellow
5       Bob   42          Idaho           NaN    58000.0     Green
6     Sarah   45       New York      New York        NaN      Blue
7    Nicole   53        Arizona       Phoenix    55000.0    Purple
8   Heather   44          Texas        Dallas  1000000.0       Red
9      Dave   30  Massachusetts        Boston   105000.0    Purple
10    Alice   32   Pennsylvania  Philadelphia    56000.0     Green
11     Alex   41       New York      New York   110000.0       Red

## Missing Data

A common issue you might run into with your dataset is columns that have missing values.  There are several ways to handle this and below we will tackle two common methods.  As we can see in the dataframe above both Sarah's salary and Bob's city are missing.  In the case of Sarah's salary, given the fact that all these observations are salaries of data scientists, we can impute her salary by taking the average of other individuals who live in her city.  This isn't always the best move to do and requires domain knowledge to understand if its appropriate to do so.  In Bob's case, there is no real way to impute his City so we will drop his observation all together.

In [4]:
df2 = df1.copy()

#This code checks if there is any null values in our dataframe:
print('Below is the number of null values for each column')
print('===============')
display(df2.isnull().values.any())

#This code tallies the number of null values per column.
display(df2.isnull().sum())

#This code imputes Sarah's salary by averaging the salaries of other observations who are also from New York
df2['Salary'] = df2['Salary'].fillna(df2.groupby('City')['Salary'].transform('mean')).astype(int)

print('')
print("Below we can see Sarah's salary has been imputed as an average \nof other data scientists from New York.")
print('===============================================================')
display(df2)
print('')

# The code below drops Bob due to his missing city.  If we forget to reset_index then the index will have a missing value and go 3,4,6 instead of 3,4,5

df2 = df2.dropna(subset= ['City'])
df2.reset_index(drop=True, inplace = True)
print("Below we can see Bob's row is removed.")
print('===============================================================')
display(df2)

Below is the number of null values for each column
===============

True

Name         0
Age          0
State        0
City         1
Salary       1
Fav.Color    0
dtype: int64

Below we can see Sarah's salary has been imputed as an average
of other data scientists from New York.
===============================================================

       Name  Age          State          City   Salary Fav.Color
0     Steve   49       New York      New York    85000      Blue
1      Dave   30  Massachusetts        Boston   105000       Red
2     Susan   44          Texas       Houston    88000      Blue
3      Mike   26       New York      New York    90000    Purple
4     Alice   32   Pennsylvania  Philadelphia    56000    Yellow
5       Bob   42          Idaho           NaN    58000     Green
6     Sarah   45       New York      New York    95000      Blue
7    Nicole   53        Arizona       Phoenix    55000    Purple
8   Heather   44          Texas        Dallas  1000000       Red
9      Dave   30  Massachusetts        Boston   105000    Purple
10    Alice   32   Pennsylvania  Philadelphia    56000     Green
11     Alex   41       New York      New York   110000       Red

Below we can see Bob's row is removed.
===============================================================

       Name  Age          State          City   Salary Fav.Color
0     Steve   49       New York      New York    85000      Blue
1      Dave   30  Massachusetts        Boston   105000       Red
2     Susan   44          Texas       Houston    88000      Blue
3      Mike   26       New York      New York    90000    Purple
4     Alice   32   Pennsylvania  Philadelphia    56000    Yellow
5     Sarah   45       New York      New York    95000      Blue
6    Nicole   53        Arizona       Phoenix    55000    Purple
7   Heather   44          Texas        Dallas  1000000       Red
8      Dave   30  Massachusetts        Boston   105000    Purple
9     Alice   32   Pennsylvania  Philadelphia    56000     Green
10     Alex   41       New York      New York   110000       Red

## Irrelevant Data

There will be times when you either have more information than you need or some of the information you have just isn't relevant to your task.  In our dummy dataset we can see that there is a column that lists each person's favorite color.  This is irrelevant data that would actually negatively affect our modeling building

In [5]:
df3 = df2.copy()

df3 = df3.drop(columns = 'Fav.Color')

print('We can see that Fav.Color is now no longer in our dataframe')
print('===============================================================')
display(df3)

We can see that Fav.Color is now no longer in our dataframe
===============================================================

       Name  Age          State          City   Salary
0     Steve   49       New York      New York    85000
1      Dave   30  Massachusetts        Boston   105000
2     Susan   44          Texas       Houston    88000
3      Mike   26       New York      New York    90000
4     Alice   32   Pennsylvania  Philadelphia    56000
5     Sarah   45       New York      New York    95000
6    Nicole   53        Arizona       Phoenix    55000
7   Heather   44          Texas        Dallas  1000000
8      Dave   30  Massachusetts        Boston   105000
9     Alice   32   Pennsylvania  Philadelphia    56000
10     Alex   41       New York      New York   110000

## Outliers

Sometimes a column in your dataset will have values that are so extreme that it will hinder your models ability to pick up the best signal possible.  For this scenario we can begin with a summary level of all columns with numeric data types. (We use .select_dtypes to increase readability by removing excessive trailing zeros).  Next, we parse through all columns with numeric data to return any values that our outside of 3 standard deviations of the columns mean.  As we can see, Heather's salary of $1,000,000 is an outlier in the Salary column.  How do we handle this outlier?  Well there are a few remedies:

1. Delete the observation
2. Implement a floor/ceiling for all values within the column
3. Impute the mean/median value inplace of the outlier.

Deleting the observation is an option but not advisable.  It's not a great practice to reduce the size of your dataset when other options are available.  Heather's information in all other columns could be useful which means depriving our model of his information could negatively affect its performance.

Implementing a floor/ceiling is a viable option that takes outliers and replaces their value with the 10th or 90th percentile value depending if the extreme value is below or above the mean.  When doing this its important to note how many observations are being changed.  If its a significant portion of the dataset then you may run into issues where your model is built off of an innaccurate set of data.

Imputing the mean/median value for the outlier is very similar to the floor/ceiling situation.  It's better than flatout removing the observation, granted that your not doing this to a large portion of your data.  By imputing the mean you are adding additional weight to the mean value which may have unintended consequences.  Business context is important for this decision.

We have already demonstrated how to remove observations so below we will walk through how to set a floor/ceiling and impute the mean/median.

In [10]:

def detect_outliers_zscore(data, name):
    thres = 3
    mean = np.mean(data)
    std = np.std(data)
    # print(mean, std)
    for i in data:
        z_score = (i-mean)/std
        if (np.abs(z_score) > thres):
            print(name + ' | ' + str(i) + ' is an outlier')

def floor_ceiling(data):
    for col in data:
        if np.issubdtype(data[col], np.number):
            tenth_percentile = np.percentile(data[col], 10)
            ninetieth_percentile = np.percentile(data[col], 90)
            upper = data[col] > ninetieth_percentile
            lower = data[col] < tenth_percentile
            data.loc[upper, col] = ninetieth_percentile
            data.loc[lower, col] = tenth_percentile

    
def impute_mean(data):
    for col in data:
        if np.issubdtype(data[col], np.number):
            thres = 3
            mean = np.mean(data[col])
            std = np.std(data[col])
            for i in data[col]:
                z_score = (i-mean)/std
                if z_score > thres: 
                    data[col].loc[data[col] == i ] = mean.astype(np.int64)
                
                
                
                    

df4 = df3.copy()

# Display original df
display(df4)

# display summary level statistics for each numerical feature
print(df4.describe().astype(np.int64))

# The code below prints out a warning if there is an observation that falls outside of 3 SD.
[detect_outliers_zscore(df4_num[i], str(i)) for i in df4_num.columns]

print('')
print('===============================================================')





# The code below sets a 10% and 90% cap on values. Notice that we are using the columns in df4_num to alter the information in df4_floor

# Create new dataframe to manipulate
df4_floor = df4.copy()

#Apply function
floor_ceiling(df4_floor)
    

print("Below is df4 with floor/ceiling on Heather's salary")
print('===============================================================')
display(df4_floor)
print('')


# Create new dataframe to manipulate
df4_mean = df4.copy()

#Apply function
impute_mean(df4_mean)

print('===============================================================')
print("Below is df4 with an imputed mean of all salary values on Heather's salary")
print('===============================================================')
display(df4_mean)
print('')

       Name  Age          State          City   Salary
0     Steve   49       New York      New York    85000
1      Dave   30  Massachusetts        Boston   105000
2     Susan   44          Texas       Houston    88000
3      Mike   26       New York      New York    90000
4     Alice   32   Pennsylvania  Philadelphia    56000
5     Sarah   45       New York      New York    95000
6    Nicole   53        Arizona       Phoenix    55000
7   Heather   44          Texas        Dallas  1000000
8      Dave   30  Massachusetts        Boston   105000
9     Alice   32   Pennsylvania  Philadelphia    56000
10     Alex   41       New York      New York   110000

       Age   Salary
count   11       11
mean    38   167727
std      9   276782
min     26    55000
25%     31    70500
50%     41    90000
75%     44   105000
max     53  1000000
Salary | 1000000 is an outlier

===============================================================
Below is df4 with floor/ceiling on Dave's salary
===============================================================

       Name  Age          State          City  Salary
0     Steve   49       New York      New York   85000
1      Dave   30  Massachusetts        Boston  105000
2     Susan   44          Texas       Houston   88000
3      Mike   30       New York      New York   90000
4     Alice   32   Pennsylvania  Philadelphia   56000
5     Sarah   45       New York      New York   95000
6    Nicole   49        Arizona       Phoenix   56000
7   Heather   44          Texas        Dallas  110000
8      Dave   30  Massachusetts        Boston  105000
9     Alice   32   Pennsylvania  Philadelphia   56000
10     Alex   41       New York      New York  110000

===============================================================
Below is df4 with an imputed mean of all salary values on Dave's salary
===============================================================

       Name  Age          State          City  Salary
0     Steve   49       New York      New York   85000
1      Dave   30  Massachusetts        Boston  105000
2     Susan   44          Texas       Houston   88000
3      Mike   26       New York      New York   90000
4     Alice   32   Pennsylvania  Philadelphia   56000
5     Sarah   45       New York      New York   95000
6    Nicole   53        Arizona       Phoenix   55000
7   Heather   44          Texas        Dallas  167727
8      Dave   30  Massachusetts        Boston  105000
9     Alice   32   Pennsylvania  Philadelphia   56000
10     Alex   41       New York      New York  110000

## Duplicate Rows

When removing duplicate rows from a dataframe we can use .drop_duplicates.  This function has a parameter "subset" which allows for multiple columns to be considering when looking for duplicates.  This helps us avoid removing data that repeats in a single column but has unique values in others.  Analyzing the dataset for the features that are most likely to indicate uniqueness can help to figure out which columns to check for matches on.  In our case we use Name, City, and Salary to filter the duplicate values for Dave from Boston and Alice from Pennsylvania.

In [7]:
df5 = df4_mean.copy()

df5 = df5.drop_duplicates(subset=['Name', 'City', 'Salary'])

df5.reset_index(drop=True, inplace = True)

display(df5)

      Name  Age          State          City  Salary
0    Steve   49       New York      New York   85000
1     Dave   30  Massachusetts        Boston  105000
2    Susan   44          Texas       Houston   88000
3     Mike   26       New York      New York   90000
4    Alice   32   Pennsylvania  Philadelphia   56000
5    Sarah   45       New York      New York   95000
6   Nicole   53        Arizona       Phoenix   55000
7  Heather   44          Texas        Dallas  167727
8     Alex   41       New York      New York  110000

## Data Concatenation

Finally, there may be instances where it might be beneficial to combine columns.  In this instance, we are going to replace State and City with a single feature that combines the two values.

In [8]:
df6 = df5.copy()

df6['State/City'] = df6['State'] + ', ' + df6['City']

display(df6)

,Name,Age,State,City,Salary,State/City
0,Steve,49,New York,New York,85000,"New York, New York"
1,Dave,30,Massachusetts,Boston,105000,"Massachusetts, Boston"
2,Susan,44,Texas,Houston,88000,"Texas, Houston"
3,Mike,26,New York,New York,90000,"New York, New York"
4,Alice,32,Pennsylvania,Philadelphia,56000,"Pennsylvania, Philadelphia"
5,Sarah,45,New York,New York,95000,"New York, New York"
6,Nicole,53,Arizona,Phoenix,55000,"Arizona, Phoenix"
7,Heather,44,Texas,Dallas,167727,"Texas, Dallas"
8,Alex,41,New York,New York,110000,"New York, New York"